IDEA StatiCa Open Model
RebarPolyLine3D.StartPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the point where the RebarPolyLine3D begins.
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public RebarPoint3D StartPoint { get; set; }
Public Property StartPoint As RebarPoint3D
	Get
	Set
public:
property RebarPoint3D^ StartPoint {
	RebarPoint3D^ get ();
	void set (RebarPoint3D^ value);
}
Property Value
Type: RebarPoint3D
See Also
Reference
RebarPolyLine3D Class
IdeaRS.OpenModel.Model Namespace